src/test/resources/ws/upload-request.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:protocol="http://soap.lab/protocol">
  <SOAP-ENV:Header>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <protocol:UploadFileRequest>
      <protocol:content>12345677</protocol:content>
    </protocol:UploadFileRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
